Retrieve the HostElementId.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public Element HostElement { get; }
  Visual Basic
Public ReadOnly Property HostElement As Element
	Get
  Visual C++
public:
property Element^ HostElement {
	Element^ get ();
}
 See Also
  BoundaryConditions Class
  Autodesk.Revit.DB.Structure Namespace